public class Main {
    public static void main(String[] args) {
        System.out.println("Homework4");
        //Задание 1
        System.out.println (" ");
        System.out.println ("Задание 1");
        int age = 25;
        if (age >= 18) {
            System.out.println("Тебе уже " + age + ". Поздравляю с совершеннолетием!");
        }
        if (age < 18) {
            System.out.println("Ты еще не достиг совершеннолетия, придется немного подождать. Твой возраст - " + age);
        }

    }
}